<footer class="w-full mt-16 py-8 bg-green-400">
    <x-modal name="contact-modal" maxWidth="md">
        <livewire:components.contact-form flg_modal="true"/>
    </x-modal>
    <div class="content flex gap-8 flex-col md:gap-4">
        <div class="flex items-center mb-16 md:mb-2 justify-between">
            <x-application-logo class="w-16 md:mx-auto"/>
            <div class="flex gap-4 md:hidden">
                <svg width="48" height="49" viewBox="0 0 48 49" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <circle cx="23.8594" cy="24.5" r="23.75" fill="white"/>
                    <path d="M13.1273 35.6765H18.0105V19.8679H13.1273V35.6765Z" fill="#B7C3AA"/>
                    <path
                        d="M12.6833 14.821C12.6833 16.3796 13.9411 17.6413 15.5689 17.6413C17.1226 17.6413 18.3804 16.3796 18.3804 14.821C18.3804 13.2624 17.1226 11.9265 15.5689 11.9265C13.9411 11.9265 12.6833 13.2624 12.6833 14.821Z"
                        fill="#B7C3AA"/>
                    <path
                        d="M31.4762 35.6765H36.4333V26.9929C36.4333 22.7624 35.4715 19.4226 30.5143 19.4226C28.1467 19.4226 26.519 20.7585 25.8531 22.0202H25.7791V19.8679H21.1179V35.6765H26.0011V27.8835C26.0011 25.8054 26.371 23.8015 28.9606 23.8015C31.4762 23.8015 31.4762 26.1765 31.4762 27.9577V35.6765Z"
                        fill="#B7C3AA"/>
                </svg>

                <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                        d="M47.6094 24.393C47.6094 11.3321 37.0912 0.75 24.1094 0.75C11.1275 0.75 0.609375 11.3321 0.609375 24.393C0.609375 36.2145 9.1376 46.034 20.4138 47.75V31.2571H14.4441V24.393H20.4138V19.2449C20.4138 13.3342 23.9199 9.99746 29.2263 9.99746C31.8795 9.99746 34.5328 10.4741 34.5328 10.4741V16.2896H31.5953C28.6578 16.2896 27.7102 18.1009 27.7102 20.0076V24.393H34.2485L33.2062 31.2571H27.7102V47.75C38.9864 46.034 47.6094 36.2145 47.6094 24.393Z"
                        fill="white"/>
                </svg>

                <svg width="49" height="49" viewBox="0 0 49 49" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <circle cx="24.3594" cy="24.5" r="23.75" fill="white"/>
                    <path
                        d="M35.4365 18.9449C36.528 18.1263 37.5103 17.144 38.2743 15.998C37.292 16.4345 36.146 16.762 34.9999 16.8711C36.2005 16.1617 37.0737 15.0702 37.5103 13.7059C36.4188 14.3608 35.1637 14.8519 33.9085 15.1248C32.817 13.9788 31.3436 13.3239 29.7064 13.3239C26.5412 13.3239 23.9763 15.8888 23.9763 19.054C23.9763 19.4906 24.0308 19.9272 24.14 20.3638C19.3922 20.0909 15.1355 17.7989 12.2977 14.3608C11.8066 15.1794 11.5337 16.1617 11.5337 17.2531C11.5337 19.2177 12.516 20.9641 14.0986 22.0009C13.1709 21.9464 12.2432 21.7281 11.4791 21.2915V21.3461C11.4791 24.1293 13.4438 26.4213 16.0632 26.967C15.6267 27.0762 15.0809 27.1853 14.5898 27.1853C14.2078 27.1853 13.8803 27.1308 13.4983 27.0762C14.2078 29.3682 16.3361 31.0054 18.8464 31.06C16.8818 32.588 14.4261 33.5158 11.752 33.5158C11.2609 33.5158 10.8243 33.4612 10.3877 33.4066C12.898 35.0438 15.8995 35.9715 19.1739 35.9715C29.7064 35.9715 35.4365 27.2945 35.4365 19.7089C35.4365 19.436 35.4365 19.2177 35.4365 18.9449Z"
                        fill="#B7C3AA"/>
                </svg>
            </div>
        </div>

        <div class="flex justify-between flex-wrap gap-4 text-lg text-white md:justify-center
         md:text-center">
            <div class="flex flex-col gap-4 md:justify-center md:text-center">
                <button href="" x-on:click="$dispatch('open-modal', 'contact-modal')"
                        class="text-white w-fit rounded px-2 bg-green-500 md:m-auto">Связаться с нами
                </button>
                <p class="">Email: info@kerama.com</p>
                <p>+7(555)-567-8901</p>
                <p>Адрес: г. Москва, Смоленская-<br>Сенная пл., 30-32</p>
            </div>
            <div class="flex flex-col gap-4 md:w-full">
                <a href="{{route('about-page')}}" wire:navigate>О нас</a>
                <a>Услуги</a>
                <a href="{{route('to-designers-page')}}" wire:navigate>Дизайнерам</a>

                <a href="{{route('to-partners-page')}}" wire:navigate>Партнёрам</a>
                <a>Доставка</a>
            </div>
            <div class="flex flex-col gap-4 md:w-full">
                <a>Оферта</a>
                <a>Политика <br> конфидициальности</a>
            </div>


            <form wire:submit="send()" class="flex justify-center flex-col gap-4 max-w-md bg-white p-8 rounded-2xl md:w-full">
                <input required wire:model="email" placeholder="Email" class="text-black !rounded-xl" type="email">
                <div class="flex gap-4 items-center">
                    <input required type="checkbox" id="police_f" name="police_f">
                    <label for="police_f" class="text-black text-base">Я даю согласие на обработку персональных данных</label><br>
                </div>
                <button
                    class="flex px-12 py-3  text-white items-center hover:bg-green-500 transition-all bg-green-500 justify-center text-center md:text-base sm:!text-sm w-full sm:!px-6 !rounded-xl">
                    <span wire:loading.remove>@if($sent)Подписан@else Подписаться на рассылку @endif</span>
                    <svg wire:loading aria-hidden="true"
                         class="w-6 h-6 mx-auto text-gray-200 animate-spin dark:text-gray-600 fill-blue-600"
                         viewBox="0 0 100 101" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M100 50.5908C100 78.2051 77.6142 100.591 50 100.591C22.3858 100.591 0 78.2051 0 50.5908C0 22.9766 22.3858 0.59082 50 0.59082C77.6142 0.59082 100 22.9766 100 50.5908ZM9.08144 50.5908C9.08144 73.1895 27.4013 91.5094 50 91.5094C72.5987 91.5094 90.9186 73.1895 90.9186 50.5908C90.9186 27.9921 72.5987 9.67226 50 9.67226C27.4013 9.67226 9.08144 27.9921 9.08144 50.5908Z"
                            fill="currentColor"/>
                        <path
                            d="M93.9676 39.0409C96.393 38.4038 97.8624 35.9116 97.0079 33.5539C95.2932 28.8227 92.871 24.3692 89.8167 20.348C85.8452 15.1192 80.8826 10.7238 75.2124 7.41289C69.5422 4.10194 63.2754 1.94025 56.7698 1.05124C51.7666 0.367541 46.6976 0.446843 41.7345 1.27873C39.2613 1.69328 37.813 4.19778 38.4501 6.62326C39.0873 9.04874 41.5694 10.4717 44.0505 10.1071C47.8511 9.54855 51.7191 9.52689 55.5402 10.0491C60.8642 10.7766 65.9928 12.5457 70.6331 15.2552C75.2735 17.9648 79.3347 21.5619 82.5849 25.841C84.9175 28.9121 86.7997 32.2913 88.1811 35.8758C89.083 38.2158 91.5421 39.6781 93.9676 39.0409Z"
                            fill="currentFill"/>
                    </svg>
                </button>
            </form>

            <div class="hidden md:block mt-8">
                <div class="flex gap-4">
                    <svg width="48" height="49" viewBox="0 0 48 49" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <circle cx="23.8594" cy="24.5" r="23.75" fill="white"/>
                        <path d="M13.1273 35.6765H18.0105V19.8679H13.1273V35.6765Z" fill="#B7C3AA"/>
                        <path
                            d="M12.6833 14.821C12.6833 16.3796 13.9411 17.6413 15.5689 17.6413C17.1226 17.6413 18.3804 16.3796 18.3804 14.821C18.3804 13.2624 17.1226 11.9265 15.5689 11.9265C13.9411 11.9265 12.6833 13.2624 12.6833 14.821Z"
                            fill="#B7C3AA"/>
                        <path
                            d="M31.4762 35.6765H36.4333V26.9929C36.4333 22.7624 35.4715 19.4226 30.5143 19.4226C28.1467 19.4226 26.519 20.7585 25.8531 22.0202H25.7791V19.8679H21.1179V35.6765H26.0011V27.8835C26.0011 25.8054 26.371 23.8015 28.9606 23.8015C31.4762 23.8015 31.4762 26.1765 31.4762 27.9577V35.6765Z"
                            fill="#B7C3AA"/>
                    </svg>

                    <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M47.6094 24.393C47.6094 11.3321 37.0912 0.75 24.1094 0.75C11.1275 0.75 0.609375 11.3321 0.609375 24.393C0.609375 36.2145 9.1376 46.034 20.4138 47.75V31.2571H14.4441V24.393H20.4138V19.2449C20.4138 13.3342 23.9199 9.99746 29.2263 9.99746C31.8795 9.99746 34.5328 10.4741 34.5328 10.4741V16.2896H31.5953C28.6578 16.2896 27.7102 18.1009 27.7102 20.0076V24.393H34.2485L33.2062 31.2571H27.7102V47.75C38.9864 46.034 47.6094 36.2145 47.6094 24.393Z"
                            fill="white"/>
                    </svg>

                    <svg width="49" height="49" viewBox="0 0 49 49" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <circle cx="24.3594" cy="24.5" r="23.75" fill="white"/>
                        <path
                            d="M35.4365 18.9449C36.528 18.1263 37.5103 17.144 38.2743 15.998C37.292 16.4345 36.146 16.762 34.9999 16.8711C36.2005 16.1617 37.0737 15.0702 37.5103 13.7059C36.4188 14.3608 35.1637 14.8519 33.9085 15.1248C32.817 13.9788 31.3436 13.3239 29.7064 13.3239C26.5412 13.3239 23.9763 15.8888 23.9763 19.054C23.9763 19.4906 24.0308 19.9272 24.14 20.3638C19.3922 20.0909 15.1355 17.7989 12.2977 14.3608C11.8066 15.1794 11.5337 16.1617 11.5337 17.2531C11.5337 19.2177 12.516 20.9641 14.0986 22.0009C13.1709 21.9464 12.2432 21.7281 11.4791 21.2915V21.3461C11.4791 24.1293 13.4438 26.4213 16.0632 26.967C15.6267 27.0762 15.0809 27.1853 14.5898 27.1853C14.2078 27.1853 13.8803 27.1308 13.4983 27.0762C14.2078 29.3682 16.3361 31.0054 18.8464 31.06C16.8818 32.588 14.4261 33.5158 11.752 33.5158C11.2609 33.5158 10.8243 33.4612 10.3877 33.4066C12.898 35.0438 15.8995 35.9715 19.1739 35.9715C29.7064 35.9715 35.4365 27.2945 35.4365 19.7089C35.4365 19.436 35.4365 19.2177 35.4365 18.9449Z"
                            fill="#B7C3AA"/>
                    </svg>
                </div>
            </div>


        </div>
        <div class="w-full h-px bg-white mb-4 mt-8 md:mb-2"></div>

        <div class="flex gap-8 mb-4 text-white text-lg ">
            <p>© 2023 Positivus. All Rights Reserved.</p>
            <p>Privacy Policy</p>
        </div>


    </div>
</footer>
